## Import pandas library

In [2]:
import pandas as pd
import numpy as np

# The series Data Structure

In [2]:
pd.Series?

In [4]:
animals=['Tiger','Dog','Mouse']
se=pd.Series(animals)

In [5]:
se

0    Tiger
1      Dog
2    Mouse
dtype: object

In [6]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [18]:
animals = ['Tiger', 'Bear', None]
a=pd.Series(animals)

In [19]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
np.nan==None

False

In [10]:
np.nan==np.nan

False

In [11]:
np.isnan(np.nan)

True

In [13]:
sports={'Archery':'Bhutan',
       'Golf':'Scotland',
       'Sumo':'Japan',
       'Taekwondo':'South Korea'}

In [14]:
sports

{'Archery': 'Bhutan',
 'Golf': 'Scotland',
 'Sumo': 'Japan',
 'Taekwondo': 'South Korea'}

In [15]:
s=pd.Series(sports)

In [16]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [17]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [24]:
s=pd.Series(['Tiger','Bear','Rat'],index=['India','America','Canada'])

In [23]:
s

india      Tiger
America     Bear
Canada       Rat
dtype: object

In [25]:
s=pd.Series(sports)

In [26]:
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [27]:
s.iloc[3]

'South Korea'

In [28]:
s[3]

'South Korea'

In [29]:
s.loc['Golf']

'Scotland'

In [30]:
s['Golf']

'Scotland'

In [31]:
sports={99:'Bhutan',
       100:'Scotland',
       101:'Japan',
       102:'South Korea'}

In [34]:
s=pd.Series(sports)

In [35]:
s

99          Bhutan
100       Scotland
101          Japan
102    South Korea
dtype: object

In [37]:
s.iloc[0]

'Bhutan'

## Disadvantages of Looping

In [3]:
s=pd.Series([100,120,101,3])

In [4]:
s

0    100
1    120
2    101
3      3
dtype: int64

In [5]:
total=0
for item in s:
    total+=item
print(total)

324

In [6]:
total=np.sum(s)
print(total)

324

In [7]:
s=pd.Series(np.random.randint(0,1000,10000))

In [9]:
s

0       353
1       868
2       443
3       983
4       949
       ...
9995    510
9996    552
9997    540
9998    965
9999    583
Length: 10000, dtype: int32

In [10]:
%%timeit -n 10
summary=0
for item in s:
    summary+=item

1.66 ms ± 260 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [11]:
%%timeit -n 10
summary=np.sum(s)

The slowest run took 12.42 times longer than the fastest. This could mean that an intermediate result is being cached.
239 µs ± 290 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [12]:
series1=pd.Series({'Archery':'Bhutan',
       'Golf':'Scotland',
       'Sumo':'Japan',
       'Taekwondo':'South Korea'})
series2=pd.Series(['Australia','Barbados','Pakistan','England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])

In [13]:
combine_all=series1.append(series2)

In [14]:
combine_all

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [16]:
combine_all['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

## DataFrame Data Structure

In [18]:
purchase1=pd.Series({'Name':'Deepak',
                    'Product':'Soap',
                    'Cost':20.0})
purchase2=pd.Series({'Name':'Sumit',
                    'Product':'Choclate',
                    'Cost':25.0})
purchase3=pd.Series({'Name':'Amit',
                    'Product':'Book',
                    'Cost':120.0})
df=pd.DataFrame([purchase1,purchase2,purchase3],index={'Store_1','Store_2','Store_3'})

In [19]:
df

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [20]:
df.head()

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [21]:
df.tail()

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [22]:
df.loc['Store_1']

Name       Deepak
Product      Soap
Cost           20
Name: Store_1, dtype: object

In [23]:
type(df.loc['Store_1'])

pandas.core.series.Series

In [24]:
df.loc['Store_1','Cost']

20.0

In [25]:
df

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [26]:
df.T

        Store_1   Store_2 Store_3
Name     Deepak     Sumit    Amit
Product    Soap  Choclate    Book
Cost         20        25     120

In [27]:
df.T.loc['Product']

Store_1        Soap
Store_2    Choclate
Store_3        Book
Name: Product, dtype: object

In [28]:
df

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [30]:
df.loc['Store_1','Cost']

20.0

In [32]:
df.loc['Store_1']['Cost']

20.0

In [33]:
df.loc[:,['Product','Cost']]

          Product   Cost
Store_1      Soap   20.0
Store_2  Choclate   25.0
Store_3      Book  120.0

In [34]:
df.drop('Store_1')

          Name   Product   Cost
Store_2  Sumit  Choclate   25.0
Store_3   Amit      Book  120.0

In [35]:
df

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [36]:
copy_df=df.copy()
copy_df=copy_df.drop('Store_1')

In [37]:
copy_df

          Name   Product   Cost
Store_2  Sumit  Choclate   25.0
Store_3   Amit      Book  120.0

In [38]:
del copy_df['Name']

In [39]:
copy_df

          Product   Cost
Store_2  Choclate   25.0
Store_3      Book  120.0

In [40]:
df

           Name   Product   Cost
Store_1  Deepak      Soap   20.0
Store_2   Sumit  Choclate   25.0
Store_3    Amit      Book  120.0

In [41]:
df['Location']='Delhi'

In [42]:
df

           Name   Product   Cost Location
Store_1  Deepak      Soap   20.0    Delhi
Store_2   Sumit  Choclate   25.0    Delhi
Store_3    Amit      Book  120.0    Delhi

## Olympic Dataset
The following code loads the olympics dataset (olympics.csv), which was derrived from the Wikipedia entry on [All Time Olympic Games Medals](https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table), and does some basic data cleaning. 

The columns are organized as # of Summer games, Summer medals, # of Winter games, Winter medals, total # number of games, total # of medals. Use this dataset to answer the questions below.

In [43]:
df=pd.read_csv('olympics.csv')

In [47]:
df.head(10)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
5,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
6,Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
7,Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
8,Azerbaijan (AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
9,Bahamas (BAH),15,5,2,5,12,0,0,0,0,0,15,5,2,5,12

In [48]:
df.tail(10)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
138,Uzbekistan (UZB),5,5,5,10,20,6,1,0,0,1,11,6,5,10,21
139,Venezuela (VEN),17,2,2,8,12,4,0,0,0,0,21,2,2,8,12
140,Vietnam (VIE),14,0,2,0,2,0,0,0,0,0,14,0,2,0,2
141,Virgin Islands (ISV),11,0,1,0,1,7,0,0,0,0,18,0,1,0,1
142,Yugoslavia (YUG) [YUG],16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
143,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
144,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
145,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
146,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
147,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [45]:
len(df)

148

In [49]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [50]:
df.index

RangeIndex(start=0, stop=148, step=1)

## Preprocessing

In [51]:
df=pd.read_csv('olympics.csv',skiprows=1,index_col=0)

In [52]:
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [54]:
df.columns# list of column name

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [55]:
df.columns[0]

'№ Summer'

In [56]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold'+col[4:]},inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver'+col[4:]},inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze'+col[4:]},inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#'+col[1:]},inplace=True)

In [57]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

### How many won more than 2 silver medals?

In [58]:
df[df['Silver']>2]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
Azerbaijan (AZE),5,6,5,15,26,5,0,0,0,0,10,6,5,15,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Uzbekistan (UZB),5,5,5,10,20,6,1,0,0,1,11,6,5,10,21
Yugoslavia (YUG) [YUG],16,26,29,28,83,14,0,3,1,4,30,26,32,29,87
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [59]:
len(df[df['Silver']>2])

82

In [60]:
len(df[df['Silver.2']>2])

83

## How many countries have won gold medal in summer games?

In [61]:
len(df[df['Gold']>0])

100

In [62]:
len(df[df['Gold.2']>0])

101

In [63]:
only_gold=df.where(df['Gold'] > 0)

In [65]:
only_gold['Gold'].count()

100

In [67]:
only_gold=only_gold.dropna()

In [68]:
only_gold

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Venezuela (VEN),17.0,2.0,2.0,8.0,12.0,4.0,0.0,0.0,0.0,0.0,21.0,2.0,2.0,8.0,12.0
Yugoslavia (YUG) [YUG],16.0,26.0,29.0,28.0,83.0,14.0,0.0,3.0,1.0,4.0,30.0,26.0,32.0,29.0,87.0
Zimbabwe (ZIM) [ZIM],12.0,3.0,4.0,1.0,8.0,1.0,0.0,0.0,0.0,0.0,13.0,3.0,4.0,1.0,8.0
Mixed team (ZZX) [ZZX],3.0,8.0,5.0,4.0,17.0,0.0,0.0,0.0,0.0,0.0,3.0,8.0,5.0,4.0,17.0
Totals,27.0,4809.0,4775.0,5130.0,14714.0,22.0,959.0,958.0,948.0,2865.0,49.0,5768.0,5733.0,6078.0,17579.0

In [69]:
len(only_gold)

100

## List of countries having gold medals in summer and winter game

In [71]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [73]:
df[(df['Gold.1'] > 0) | (df['Gold'] == 0)]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Australia (AUS) [AUS] [Z],25,139,152,177,468,18,5,3,4,12,43,144,155,181,480
Austria (AUT),26,18,33,35,86,22,59,78,81,218,48,77,111,116,304
Bahrain (BRN),8,0,0,1,1,0,0,0,0,0,8,0,0,1,1
Barbados (BAR) [BAR],11,0,0,1,1,0,0,0,0,0,11,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam (VIE),14,0,2,0,2,0,0,0,0,0,14,0,2,0,2
Virgin Islands (ISV),11,0,1,0,1,7,0,0,0,0,18,0,1,0,1
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [74]:
len(df[(df['Gold.1'] > 0) | (df['Gold'] == 0)])

84

In [75]:
len(df[(df['Gold.1'] > 0) & (df['Gold'] == 0)])

1

In [76]:
df[(df['Gold.1'] > 0) & (df['Gold'] == 0)]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein (LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9

In [77]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [83]:
df['Gold'].idxmax()

'United States\xa0(USA) [P] [Q] [R] [Z]'

In [82]:
df = df.drop('Totals')

In [84]:
df['Gold'].idxmin()

'Afghanistan\xa0(AFG)'

### Question 1 (Example)

What is the first country in df?

This function should return a Series.

### Question 2
Which country has won the most gold medals in summer games?

*This function should return a single string value.*

### Question 3
Which country had the biggest difference between their summer and winter gold medal counts?

*This function should return a single string value.*

### Question 4
Which country has the biggest difference between their summer gold medal counts and winter gold medal counts relative to their total gold medal count? 

$$\frac{Summer~Gold - Winter~Gold}{Total~Gold}$$

Only include countries that have won at least 1 gold in both summer and winter.

*This function should return a single string value.*